win95/RTOS-STM32f407/main.c
	/*!< Most systems default to the wanted configuration, with the noticeable 
		exception of the STM32 driver library. If you are using an STM32 with 
		the STM32 driver library then ensure all the priority bits are assigned 
		to be preempt priority bits by calling 
		NVIC_PriorityGroupConfig( NVIC_PriorityGroup_4 ); before the RTOS is started.
	*/
	NVIC_PriorityGroupConfig( NVIC_PriorityGroup_4 );
	
		/* Initialize system */
	SystemInit();
	/* init OUTPUT*/
	TM_GPIO_Init(RELAY_DK1_PORT, RELAY_DK1_PIN, TM_GPIO_Mode_OUT, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High);
	TM_GPIO_Init(RELAY_DK2_PORT, RELAY_DK2_PIN, TM_GPIO_Mode_OUT, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High);
	TM_GPIO_Init(RELAY_DK3_PORT, RELAY_DK3_PIN, TM_GPIO_Mode_OUT, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High);
	TM_GPIO_Init(RELAY_DK4_PORT, RELAY_DK4_PIN, TM_GPIO_Mode_OUT, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High);
	/* init OUTPUT*/
	STM_EVAL_LEDInit(LED_ORANGE);
/* Initialize USART6 at 115200 baud, TX: PC6, RX: PC7 , COM 1 - RFID1 gan cong tac nguon*/ 
	TM_USART_Init(USART6, TM_USART_PinsPack_1, 115200);
/* Initialize USART3 at 115200 baud, TX: PD8, RX: PD9 ,	COM 2 -PC gan ethernet*/
	TM_USART_Init(USART3, TM_USART_PinsPack_3, 115200);
/* Initialize USART1 at 115200 baud, TX: PA9, RX: PA10, CONG 485 */
	TM_USART_Init(USART1, TM_USART_PinsPack_1, 9600);
if (!TM_RTC_Init(TM_RTC_ClockSource_Internal)) {
		/* RTC was first time initialized */
		/* Do your stuff here */
		/* eg. set default time */
	}
	/* Set wakeup interrupt every 1 second */
	TM_RTC_Interrupts(TM_RTC_Int_60s);
/*Task Create Begin*/
	xTaskCreate( vConfigure, (const signed char*)"Configure using DTMF", 
		STACK_SIZE_MIN, NULL, tskIDLE_PRIORITY, NULL );
	xTaskCreate( vLedBlinkRed, (const signed char*)"Led Blink Task Red", 
		STACK_SIZE_MIN, NULL, tskIDLE_PRIORITY, NULL );
	xTaskCreate( vEthernet, (const signed char*)"Ethernet Running ..", 
		STACK_SIZE_MIN, NULL, tskIDLE_PRIORITY, NULL );
	xTaskCreate( vMain, (const signed char*)"Main run ...", 
		STACK_SIZE_MIN, NULL, tskIDLE_PRIORITY, NULL );

	vTaskStartScheduler();
}
//******************************************************************************
//******************************************************************************
void vConfigure(void *pvParameters)
{
unsigned int config=0;
unsigned int config1=0;
unsigned int config2=0;
unsigned int config3=0;
unsigned int config4=0;
unsigned int config5=0;
unsigned int config6=0;
uint8_t key;
char str_config[20];
static uint8_t	cnt=0;
		TM_WATCHDOG_Reset();
	for(;;)
	{

if(flag_dtmf==1){
	key = express;
	if((key=='*')&&(config==0)) config =1;
	if(config==1){
		if((config1+config2+config3+config4+config5+config6)==0){
		if((key=='1')&&(config1==0)) config1=1;
		if((key=='2')&&(config2==0)) config2=1;
		if((key=='3')&&(config3==0)) config3=1;
		if((key=='4')&&(config4==0)) config4=1;
		if((key=='5')&&(config5==0)) config5=1;
		if((key=='6')&&(config6==0)) config6=1;
		cnt =0;
		memset(str_config,0,0);
		}
		if(config1==1){
		str_config[cnt] = key;
		cnt++;
		if(key=='#') { 
		printf_d("ket thuc chuoi lenh1\n");
		config =0;
		config1 =0;
		cnt=0;
		sprintf(str,"%s",str_config);
		printf_d(str);
		}}
		if(config2==1){
		str_config[cnt] = key;
		cnt++;
		if(key=='#') { 
		printf_d("ket thuc chuoi lenh2\n");
		config =0;
		config2 =0;
		cnt=0;
		sprintf(str,"%s",str_config);
		printf_d(str);
		}}
		if(config3==1){
		str_config[cnt] = key;
		cnt++;
		if(key=='#') { 
		printf_d("ket thuc chuoi lenh3\n");
		config =0;
		config3 =0;
		cnt=0;
		sprintf(str,"%s",str_config);
		printf_d(str);
		}}
		if(config4==1){
		str_config[cnt] = key;
		cnt++;
		if(key=='#') { 
		printf_d("ket thuc chuoi lenh4\n");
		config =0;
		config4 =0;
		cnt=0;
		sprintf(str,"%s",str_config);
		printf_d(str);
		}}
		if(config5==1){
		str_config[cnt] = key;
		cnt++;
		if(key=='#') { 
		printf_d("ket thuc chuoi lenh5\n");
		config =0;
		config5 =0;
		cnt=0;
		sprintf(str,"%s",str_config);
		printf_d(str);
		}}
		if(config6==1){
		str_config[cnt] = key;
		cnt++;
		if(key=='#') { 
		printf_d("ket thuc chuoi lenh6\n");
		config =0;
		config6 =0;
		cnt=0;
		sprintf(str,"%s",str_config);
		printf_d(str);
		}}		
		}	
	if(key=='#') {
		config=0;
		memset(str_config,'\0',0);
	}
	flag_dtmf =0;	
}
	TM_WATCHDOG_Reset();
}
}
void vLedBlinkRed(void *pvParameters)
{
//	/* Free and total space */
//	uint32_t total, free;
//	static FRESULT rc;   /* Result code */  
//	static UINT bw, br, numread;
//    static BYTE buff[64];
//    BYTE Message[] = "HELLO" ; // message's content
//    TCHAR *FilePath = "MESSAGE.TXT" ; // file path
//		/* Mount drive */
//	if (f_mount(&FatFs, "0:", 1) == FR_OK) {
//		/* Mounted OK, turn on RED LED */
//		
//		/* Try to open file */
//		if (f_open(&fil,FilePath, FA_CREATE_ALWAYS | FA_READ | FA_WRITE | FA_OPEN_ALWAYS) == FR_OK) {
//			/* File opened, turn off RED and turn on GREEN led */
//			
////			/* If we put more than 0 characters (everything OK) */
////			if (f_puts("First string in my file\n", &fil) > 0) {
////				if (TM_FATFS_DriveSize(&total, &free) == FR_OK) {
////					/* Data for drive size are valid */
////				}
////			}
//    rc = f_write(&fil, Message, sizeof(Message)-1, &bw); // write file

//    if (!rc) {
//      sprintf(str,"write success. %u bytes written.\n\r", bw);
//			printf_d(str);
//    }else  {
//      sprintf(str,"write file Failure...error = %u\n\r",rc);
//			printf_d(str);
//    }			
//   sprintf(str,"\nClose the file writeen.\n\r");
//    printf_d(str);
//		taskENTER_CRITICAL ();
//		rc = f_close(&fil); // close file
//		taskEXIT_CRITICAL ();
//    if (!rc) {
//      sprintf(str,"File writeen closed success.\n\r");
//    printf_d(str);
//		}else  {
//      sprintf(str,"File close writeen was failure...error = %u\n\r",rc);
//    printf_d(str);
//		}
//		}
//		
//		/* Unmount drive, don't forget this! */
//		f_mount(0, "0:", 1);
//	}
		TM_WATCHDOG_Reset();
	for(;;)
	{
		TM_WATCHDOG_Reset();
		STM_EVAL_LEDToggle(LED_ORANGE);
		vTaskDelay(50 / portTICK_RATE_MS );
	}
}

void vEthernet(void *pvParameters)
{	
	printf_d("Program starting..\n");
	//TM_USART_Puts(USART3,"Program starting..\n");
	if (TM_ETHERNET_Init(NULL, ipadress, getwayadress, netmaskadress) == TM_ETHERNET_Result_Ok) {
	printf_d("TM_ETHERNET_Init OK \n");
	}

		/* Reset watchdog */
	TM_WATCHDOG_Reset();
	for(;;)
	{
//		vTaskDelay( 250 / portTICK_RATE_MS );
				/* Update ethernet, call this as fast as possible */
		TM_ETHERNET_Update();
		/* Reset watchdog */
		TM_WATCHDOG_Reset();
	}
	
